app/controllers/bookmarks_controller.rb

  def create
    @bookmark = Bookmark.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save
---
INSERT INTO "bookmarks" ("comment", "movie_id", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "Great movie!"], ["movie_id", 2], ["list_id", 2], ["created_at", "2023-05-25 03:00:41.058999"], ["updated_at", "2023-05-25 03:00:41.058999"]]

  def destroy
    @bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 4]]

    def set_bookmark
      @bookmark = Bookmark.find(params[:id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]