app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Comedy"], ["created_at", "2023-05-25 03:00:41.094892"], ["updated_at", "2023-05-25 03:00:41.094892"]]